[{"caption": "Driving from Bent to Corvallis. Barren pine trees on snowy mountains look like hair folicles.", "name": "003_willamette_forest"}, {"caption": "Enormous pine trees flank Route 20 in the Willamette National Forest.", "name": "005_willamette_forest"}, {"caption": "When the pine trees finally yield some soil to some non-pine trees, they are covered in thick green moss.", "name": "011_willamette_forest"}, {"caption": "", "name": "012_willamette_forest"}, {"caption": "", "name": "013_willamette_forest"}, {"caption": "Sunlight hits the moss covered branches of this tree in the Willamette National Forest", "name": "014_willamette_forest"}, {"caption": "Ghost town set up in one of the small logging towns", "name": "015_willamette_forest"}, {"caption": "", "name": "016_willamette_forest"}, {"caption": "Foster Lake. Near Sweet Home, Oregon. I also passed towns named Boring and ZigZag.", "name": "021_willamette_forest"}, {"caption": "The Pub and Pedal meet up point, with special guest Big Wave Lew.", "name": "030_pub_and_pedal"}, {"caption": "Crossing the Willamette River in Portland", "name": "031_pub_and_pedal"}, {"caption": "Hey, check out those red socks!", "name": "032_pub_and_pedal"}, {"caption": "The pub portion of the Pub and Pedal", "name": "033_pub_and_pedal"}, {"caption": "Bernie with a choice potato chip", "name": "034_pub_and_pedal"}, {"caption": "Rostropovich cello trio at the Launchpad art gallery opening for Brent Wear", "name": "040_launchpad"}, {"caption": "I tried to catch this M4 drum but as I was fiddling with the camera the band member came and took it away, but I still like the colors in this photo.", "name": "042_launchpad"}, {"caption": "The Mobile Groove Bomb bus stationed outside the Bossa Nova club before the March Fourth show", "name": "050_march_fourth"}, {"caption": "March Fourth. Part marching band. Part side show. Part Burlesque.", "name": "053_march_fourth"}, {"caption": "That statue on the right is a really cool stretched out figure whose dimensions get gradually larger from head to toe", "name": "056_march_fourth"}, {"caption": "The stilt walkers invade the dance floor. Stilt walker crowd surfing was later.", "name": "057_march_fourth"}, {"caption": "", "name": "060_march_fourth"}, {"caption": "", "name": "062_march_fourth"}, {"caption": "Auctioning off the Mobile Groove Bomb panties at the end of the show.  I thought seriously about pulling out the HP corporate AmEx for this, but then reconsidered.", "name": "063_march_fourth"}, {"caption": "M4 snare harness. Way more tricked out than the CHS ones.", "name": "064_march_fourth"}, {"caption": "Protest march for marijuana legalization that blocked us on the way to pick up Lew", "name": "072_legalize_it_march"}, {"caption": "Venturing into the thick of Washington Park", "name": "075_washington_park"}, {"caption": "", "name": "076_washington_park"}, {"caption": "Tree roots are just so undeniably cool", "name": "077_washington_park"}, {"caption": "", "name": "079_washington_park"}, {"caption": "Plan B restaurant before the Laura Veirs show", "name": "081_laura_veirs"}, {"caption": "The impetus for Portland visit number one", "name": "094_laura_veirs"}, {"caption": "", "name": "095_laura_veirs"}, {"caption": "Woo Hoo! Laura Veirs live in her home town.  I was ecstatic during the show.", "name": "099_laura_veirs"}, {"caption": "Not a great shot, but I love this photo.  As we come to the end of our 20s we go home early.  In Portland, when you've had enough and want to signal to your boyfriend that you are ready to leave, you put on your bike helmet.", "name": "102_laura_veirs"}, {"caption": "Vegan corn cakes", "name": "110_sunday"}, {"caption": "Wyatt led us to a bike polo match in the park", "name": "111_sunday"}, {"caption": "Wyatt got in there and played a round.  Looks pretty tricky, and it helps if you have a fixed speed beater bike.", "name": "112_sunday"}]
